# pandas library

In [1]:
import pandas as pd
data = {
    'Name': ['John', 'Alice', 'Bob', 'Eve','moneeb','saran','abdul','wahab','bilal'],
    'Age': [28, 25, 32, 30,40,67,12,76,78],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston','kotli','Rawalakot','Muzaffarabad','Pindi','Pounch']
}

df = pd.DataFrame(data)
print(df)

     Name  Age          City
0    John   28      New York
1   Alice   25   Los Angeles
2     Bob   32       Chicago
3     Eve   30       Houston
4  moneeb   40         kotli
5   saran   67     Rawalakot
6   abdul   12  Muzaffarabad
7   wahab   76         Pindi
8   bilal   78        Pounch

In [2]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [3]:
df['Name']

0      John
1     Alice
2       Bob
3       Eve
4    moneeb
5     saran
6     abdul
7     wahab
8     bilal
Name: Name, dtype: object

In [4]:
a = df['Name'][0:5]

In [5]:
a

0      John
1     Alice
2       Bob
3       Eve
4    moneeb
Name: Name, dtype: object

In [6]:
type(a)

pandas.core.series.Series

In [7]:
m1 = pd.Series([100,200,300,400,500],index = [1,2,3,4,5])
print(m1)

1    100
2    200
3    300
4    400
5    500
dtype: int64

In [8]:
m2 = pd.Series([600,700,800,900,1000], index = [1,2,3,4,5])
print(m2)

1     600
2     700
3     800
4     900
5    1000
dtype: int64

# Concatenating two variables in pandas

In [9]:
m3 = pd.concat([m1,m2])
print(m3)

1     100
2     200
3     300
4     400
5     500
1     600
2     700
3     800
4     900
5    1000
dtype: int64

In [10]:
m3[1]

1    100
1    600
dtype: int64

In [11]:
m3[5]

5     500
5    1000
dtype: int64

In [12]:
m1*m2

1     60000
2    140000
3    240000
4    360000
5    500000
dtype: int64

In [13]:
m1+m2

1     700
2     900
3    1100
4    1300
5    1500
dtype: int64

In [14]:
df

     Name  Age          City
0    John   28      New York
1   Alice   25   Los Angeles
2     Bob   32       Chicago
3     Eve   30       Houston
4  moneeb   40         kotli
5   saran   67     Rawalakot
6   abdul   12  Muzaffarabad
7   wahab   76         Pindi
8   bilal   78        Pounch

# Delete column

In [15]:
df.drop("Name",axis = 1)

   Age          City
0   28      New York
1   25   Los Angeles
2   32       Chicago
3   30       Houston
4   40         kotli
5   67     Rawalakot
6   12  Muzaffarabad
7   76         Pindi
8   78        Pounch

In [16]:
df.head()

     Name  Age         City
0    John   28     New York
1   Alice   25  Los Angeles
2     Bob   32      Chicago
3     Eve   30      Houston
4  moneeb   40        kotli

# For parmanently delete column

In [17]:
df.drop("Name",axis = 1, inplace = True)

In [18]:
df

   Age          City
0   28      New York
1   25   Los Angeles
2   32       Chicago
3   30       Houston
4   40         kotli
5   67     Rawalakot
6   12  Muzaffarabad
7   76         Pindi
8   78        Pounch

# Delete a row

In [22]:
df.drop(3)

     Name  Age          City
0  Moneeb   28      New York
1  Moneeb   25   Los Angeles
2  Moneeb   32       Chicago
4  Moneeb   40         kotli
5  Moneeb   67     Rawalakot
6  Moneeb   12  Muzaffarabad
7  Moneeb   76         Pindi
8  Moneeb   78        Pounch

In [20]:
df.insert(loc = 0,column = 'Name',value = 'Moneeb')

In [21]:
df

     Name  Age          City
0  Moneeb   28      New York
1  Moneeb   25   Los Angeles
2  Moneeb   32       Chicago
3  Moneeb   30       Houston
4  Moneeb   40         kotli
5  Moneeb   67     Rawalakot
6  Moneeb   12  Muzaffarabad
7  Moneeb   76         Pindi
8  Moneeb   78        Pounch

# Setting index

In [26]:
df.set_index('Name',inplace = True)

In [27]:
df

        Age          City
Name
Moneeb   28      New York
Moneeb   25   Los Angeles
Moneeb   32       Chicago
Moneeb   30       Houston
Moneeb   40         kotli
Moneeb   67     Rawalakot
Moneeb   12  Muzaffarabad
Moneeb   76         Pindi
Moneeb   78        Pounch

# Reset the index

In [30]:
df.reset_index('Name',inplace = True)

In [31]:
df

     Name  Age          City
0  Moneeb   28      New York
1  Moneeb   25   Los Angeles
2  Moneeb   32       Chicago
3  Moneeb   30       Houston
4  Moneeb   40         kotli
5  Moneeb   67     Rawalakot
6  Moneeb   12  Muzaffarabad
7  Moneeb   76         Pindi
8  Moneeb   78        Pounch